{
  "projects": [
    {
      "id": 0,
      "year": "2017",
      "link": "",
      "titleProject": "Silva",
      "shortDescription": "A web app that makes it easy for you to connect and share messages with your colleagues.",
      "technologies": {
        "name": "HTML5, CSS3, Sass, Vue js, Webpack, Eslint, Bootstrap, vue-cli"
      },
      "projectSpecification": {
        "leftColumn": "My favorite project that require me to push beyond my boundaries and acquire new skills and knowledge. This web app was created with a Vue.js Java Script framework - a great solution for this use case, combined with Webpack Sass and Bootstrap.I develop this app within 2-3 weeks. This is my first project with Vue and I got in touch with API and started to get a feel on how to work and config the views. I use vue-packeges to sent HTTP request. This API should return only approved messages. Also when scroling to the bottom of the messages list, the API should be called with a 'x' offset GET request, so I can get the next couple of messages.",
        "rightColumn": "I was responsible for the overall construction of the app. Another interesting component was the aoutocumplete bar with all the company emails to search from(this is for choosing who to send the message to). And the main feed which showing all the users with there claimed messages. Designed to be a responsive mobile-first web application which I'm developing to phone app with Android and Cordova"
      },
      "imgUrl": "./img/img_0.jpg"
    },
    {
      "id": 1,
      "year": "2016",
      "link": "",
      "titleProject": "Rehio accountant cockpit",
      "shortDescription": "Responsive web application for accountant management and client invitation",
      "technologies": {
        "name": "HTML5, CSS3, Sass, Angular 1, Angular Material, Gulp, Bower, Bourbon"
      },
      "projectSpecification": {
        "leftColumn": "This project is a responsive web application for accountant and client management and is part of another large system Bexio. Angular 1 is the technology we used in the project with my colleagus. For interaction design I choose Angular Material framework which I already knew from a prev. projects. My role and responsibilities as a Front-End developer was to set-up the project, create views, styling app, routing and  basic support for functionality.",
        "rightColumn": "Some of this code which I develop was the header functionality, search directive, custom sorting, form validation... At the ending of the project I made a refactoring of my code and for the purpose I used BEM methodology and re"
      },
      "imgUrl": "https://shantellmartin.art/media/project_block_image2/main/31021911312_d29174a155_o_201702091938_201702091938.jpg"
    },
    {
      "id": 2,
      "year": "2017",
      "link": "https://www.amorisk.com/",
      "titleProject": "Amo risk",
      "shortDescription": "Risk Management System for planned purchases of materials",
      "technologies": {
        "name": "Java Script, jQuery, Razor, Bootstrap Theme, Sass & gulp integration"
      },
      "projectSpecification": {
        "leftColumn": "Amo Risk project is .NET based. I have had a lot of similar projects in my career as a Front-end developer. Becouse the project isn't provide a design I did visual exploration to discribe their solution with a suitable Bootstrap Theme, as I have used.",
        "rightColumn": "My role as a Front-end was to create and style project goals views. I'm familiar with Razor, Partial views with Ajax reques, MVC folder sctucture, Action methods... "
      },
      "imgUrl": "https://shantellmartin.art/media/project_block_image2/main/31021911312_d29174a155_o_201702091938_201702091938.jpg"
    },
	{
      "id": 3,
      "year": "2016",
      "link": "https://www.teamgb.com/",
      "titleProject": "Team GB",
      "shortDescription": "From British Olympic Association about Games held in Baku 2015",
      "technologies": {
        "name": "Sitefinity CMS, Java Script, jQuery, Bootstrap, Sass & gulp integration"
      },
      "projectSpecification": {
        "leftColumn": "TeamGB website was made in collaboration with British Olympic Association. Their role is to lead the promotion of the Olympic Movements. This is a large-scale project that include three smaller ones for their sponsors in which I'm Front-end developer too.",
        "rightColumn": "Sytefinity is the content management sistem which ours teem used to build the site. I have been with the project since its early days. I was responsible for page building and styling, for managing different types of modules and widgets from the Sytefinity CMS. TeamGB is a fully responsive and well tested to support cross-platforms and browsers. The project contains a huge Java Script components, modular structure(reuse blocks and widgets on any page) and Facebook integration."
      },
      "imgUrl": "https://shantellmartin.art/media/project_block_image2/main/31021911312_d29174a155_o_201702091938_201702091938.jpg"
    },
    {
      "id": 4,
      "year": "2015",
      "link": "hhttp://www.us4bg.org/",
      "titleProject": "America for Bulgaria",
      "shortDescription": "Foundation friendship between the American and Bulgarian people-to-people contacts",
      "technologies": {
        "name": "Umbraco CMS, Java Script, jQuery, Bootstrap, Sass & gulp integration"
      },
      "projectSpecification": {
        "leftColumn": "For the website the goal of this project was to create for collaboration with American Foundation and Bulgaria. Their role is to enhance the longstanding legacy of goodwill and friendship between US – Bulgaria people. I was responsible for integration of designer wireframes into front-end code.",
        "rightColumn": "This project is a fully responsive and well tested to support cross-platforms and browsers. While much of the project has already been completed, it still need additional support for new ideas."
      },
      "imgUrl": "https://shantellmartin.art/media/project_block_image2/main/31021911312_d29174a155_o_201702091938_201702091938.jpg"
    }
  ]
}
